package com.web.springboot.common;

import com.alibaba.fastjson.JSON;
import com.web.springboot.entity.vo.ScatterDataVO;

import java.util.Arrays;
import java.util.List;

public class MapCpConstants {
    /**
     * 中国地图省份经纬度
     */
    private final static String mapCp=
            "[{ \"name\": \"北京\", \"value\": [116.405289, 39.904987] },\n" +
            "{ \"name\": \"天津\", \"value\": [117.190186, 39.125595] },\n" +
            "{ \"name\": \"河北\", \"value\": [114.502464, 38.045475] },\n" +
            "{ \"name\": \"黑龙江\", \"value\": [126.642464, 45.756966] },\n" +
            "{ \"name\": \"吉林\", \"value\": [125.324501, 43.886841] },\n" +
            "{ \"name\": \"辽宁\", \"value\": [123.429092, 41.796768] },\n" +
            "{ \"name\": \"内蒙古\", \"value\": [111.75199, 40.84149] },\n" +
            "{ \"name\": \"山西\", \"value\": [112.549248, 37.857014] },\n" +
            "{ \"name\": \"山东\", \"value\": [117.000923, 36.675808] },\n" +
            "{ \"name\": \"河南\", \"value\": [113.665413, 34.757977] },\n" +
            "{ \"name\": \"陕西\", \"value\": [108.948021, 34.263161] },\n" +
            "{ \"name\": \"湖北\", \"value\": [114.298569, 30.584354] },\n" +
            "{ \"name\": \"江苏\", \"value\": [118.76741, 32.041546] },\n" +
            "{ \"name\": \"安徽\", \"value\": [117.283043, 31.861191] },\n" +
            "{ \"name\": \"上海\", \"value\": [121.472641, 31.231707] },\n" +
            "{ \"name\": \"湖南\", \"value\": [112.982277, 28.19409] },\n" +
            "{ \"name\": \"江西\", \"value\": [115.892151, 28.676493] },\n" +
            "{ \"name\": \"浙江\", \"value\": [120.15358, 30.287458] },\n" +
            "{ \"name\": \"福建\", \"value\": [119.306236, 26.075302] },\n" +
            "{ \"name\": \"广东\", \"value\": [113.28064, 23.125177] },\n" +
            "{ \"name\": \"台湾\", \"value\": [121.520076, 25.030724] },\n" +
            "{ \"name\": \"海南\", \"value\": [110.19989, 20.04422] },\n" +
            "{ \"name\": \"广西\", \"value\": [108.320007, 22.82402] },\n" +
            "{ \"name\": \"重庆\", \"value\": [106.504959, 29.533155] },\n" +
            "{ \"name\": \"云南\", \"value\": [102.71225, 25.040609] },\n" +
            "{ \"name\": \"贵州\", \"value\": [106.713478, 26.578342] },\n" +
            "{ \"name\": \"四川\", \"value\": [104.065735, 30.659462] },\n" +
            "{ \"name\": \"宁夏\", \"value\": [106.23248, 38.48644] },\n" +
            "{ \"name\": \"甘肃\", \"value\": [103.83417, 36.06138] },\n" +
            "{ \"name\": \"青海\", \"value\": [101.77782, 36.61729] },\n" +
            "{ \"name\": \"西藏\", \"value\": [91.1145, 29.64415] },\n" +
            "{ \"name\": \"新疆\", \"value\": [87.61688, 43.82663] },\n" +
            "{ \"name\": \"香港\", \"value\": [114.16546, 22.27534] },\n" +
            "{ \"name\": \"澳门\", \"value\": [113.54913, 22.19875] }]";

    public final static List<ScatterDataVO> scatterDataList=JSON.parseArray(mapCp,ScatterDataVO.class);

    public final static List<String> city= Arrays.asList("北京市","上海市","重庆市","天津市");

}
